README.org
#+OPTIONS: ^:{} \n:t

* lisp resources

** haskell

- https://en.wikibooks.org/wiki/Write_Yourself_a_Scheme_in_48_Hours
- https://github.com/zepto-lang/zepto
- https://github.com/justinethier/husk-scheme
- https://github.com/justinethier/cyclone
- http://dev.stephendiehl.com/fun/

** python

- http://www.norvig.com/lispy.html
- https://github.com/shvechikov/lisp.py
- http://pythonpracticeprojects.com/lisp.html

* VM

** eth tools

- https://ethervm.io/
- https://dapp.tools/ ([[https://github.com/dapphub/dapptools][gh]]) ([[https://dapphub.chat/home][chat]])

** pyevmasm

- [[https://github.com/crytic/pyevmasm][GitHub - crytic/pyevmasm: EVM disassembler and assembler]]
- [[https://pyevmasm.readthedocs.io/en/latest/genindex.html][Index — pyevmasm documentation]]

** vyper

vyper/opcodes.py at master · vyperlang/vyper
https://github.com/vyperlang/vyper/blob/master/vyper/evm/opcodes.py

** Resources

ethereum-evm-illustrated - ethereum_evm_illustrated.pdf
https://takenobu-hs.github.io/downloads/ethereum_evm_illustrated.pdf

Ethereum Virtual Machine (EVM) | ethereum.org
https://ethereum.org/en/developers/docs/evm/

[[https://github.com/ajlopez/evmasm][GitHub - ajlopez/evmasm: EVM (Ethereum Virtual Machine) assembler]]
(lire le dossier samples/compile pour voir des exemples de contracts compilés)

Ethereum Virtual Machine (EVM) | ethereum.org
https://ethereum.org/en/developers/docs/evm/

Introduction to Smart Contracts — Solidity 0.8.8 documentation
https://docs.soliditylang.org/en/latest/introduction-to-smart-contracts.html#index-6

beigepaper/beigepaper.pdf at master · chronaeon/beigepaper
https://github.com/chronaeon/beigepaper/blob/master/beigepaper.pdf

crytic/evm-opcodes: Ethereum opcodes and instruction reference
https://github.com/crytic/evm-opcodes

ethereum/py-evm: A Python implementation of the Ethereum Virtual Machine
https://github.com/ethereum/py-evm

*** Testing

crytic/echidna: Ethereum smart contract fuzzer
https://github.com/crytic/echidna


*** Zinc / Zksync

Introduction - Zinc v0.2.3
https://zinc.zksync.io/index.html

matter-labs/zinc: The Zinc language public repository
https://github.com/matter-labs/zinc

* Doc

[[file:doc/schevm.html::<?xml version="1.0" encoding="utf-8"?>]]

